package absoft;
/*
Написать программу которая будет выводить цифры от 1 до 5 используя цикл for
 */

public class test6_for {
    public static void main (String [] args){
        for (int x = 1; x < 6; x++) {
            System.out.println(x);
        }
    }

}
